app/Models/CouponsModel.php

SELECT *
FROM `coupons`
WHERE `code` = 'KUPON123'
---
    public function getCouponExpiredDate($code)
    {
        $result = $this->where('code', $code)->get()->getRow();

SELECT COUNT(*) AS `numrows`
FROM `coupons`
WHERE `code` = 'KUPON123'
---
    public function isCouponExist($code)
    {
        return ($this->where('code', $code)->countAllResults() > 0) ? true : false;

SELECT *
FROM `coupons`
WHERE `code` = 'KUPON123'
---
    public function isCouponActive($code)
    {
        $result = $this->where('code', $code)->get()->getRow();

SELECT *
FROM `coupons`
WHERE `code` = 'KUPON123'
---
    public function isCouponExpired($code)
    {
        $result = $this->where('code', $code)->get()->getRow();

SELECT *
FROM `coupons`
WHERE `code` = 'KUPON123'
---
    public function getCouponCredit($code)
    {
        $result = $this->where('code', $code)->get()->getRow();

SELECT *
FROM `coupons`
WHERE `code` = 'KUPON123'
---
    public function getCouponId($code)
    {
        $result = $this->where('code', $code)->get()->getRow();

SELECT *
FROM `coupons`
WHERE `code` = 'KUPON123'
---
    public function isCouponUsed($code)
    {
        $result = $this->where('code', $code)->get()->getRow();

UPDATE `coupons` SET `is_used` = 1
WHERE `id` = '1'
---
    public function markCouponAsUsed($code)
    {
        $couponId = $this->getCouponId($code);

        if ($couponId) {
            $this->set('is_used', 1)
                ->where('id', $couponId)
                ->update();